{
  "version": 1,
  "project": "agentik-coding-agent-tui-refresh",
  "last_updated": "2026-02-05 13:15:25 -0500",
  "instructions": {
    "resume": [
      "Run ./init.sh first to restore context.",
      "Read PLAN.md, features.json, and session.txt in that order.",
      "Follow feature order; mark each feature status as done before committing.",
      "Log decisions and validations in session.txt.",
      "Commit after each feature with a scoped message."
    ]
  },
  "features": [
    {
      "id": "F00",
      "title": "Bootstrap planning assets",
      "status": "done",
      "depends_on": [],
      "files": ["PLAN.md", "features.json", "init.sh", "session.txt"],
      "steps": [
        "Create PLAN.md in the repo root summarizing goals, scope, and execution order.",
        "Create features.json with detailed step-by-step instructions, acceptance criteria, and validation for each feature.",
        "Create init.sh that prints repo context (git status, log), surfaces PLAN.md/features.json/session.txt, and appends a timestamped entry to session.txt. It must explicitly mention that session.txt can be mined for context/history.",
        "Create session.txt with an initial entry describing the baseline state and intent.",
        "Run ./init.sh once after creation to verify output and populate session.txt.",
        "Update features.json status to done and append a session.txt entry.",
        "Commit with message: `chore: add planning assets`."
      ],
      "acceptance": [
        "PLAN.md exists at repo root and matches the intended scope.",
        "features.json has complete instructions and is valid JSON.",
        "init.sh runs without error and prints required context.",
        "session.txt exists and includes init.sh output and a note that it can be mined for context.",
        "Git commit exists for this feature."
      ],
      "validation": ["Run: `bash init.sh`", "Check: `git status -sb`"],
      "notes": "Do not edit docs/PLAN.md; user requested a new root PLAN.md."
    },
    {
      "id": "F01",
      "title": "Runtime: subagent metadata + event emission",
      "status": "pending",
      "depends_on": ["F00"],
      "files": [
        "packages/runtime/src/types.ts",
        "packages/runtime/src/subagents.ts",
        "packages/runtime/src/agent-runtime.ts"
      ],
      "steps": [
        "Extend AgentToolDefinition base type with optional fields: `kind?: \"subagent\"` and `subagentId?: string`.",
        "Extend AgentEvent union with subagent lifecycle events: subagent_start, subagent_update, subagent_end. Include toolCallId, subagentId, prompt (for start), delta/ui (for update), and output/isError/ui (for end).",
        "Update createSubagentTool to set `kind: \"subagent\"` and `subagentId` on the tool definition.",
        "In AgentRuntime.runOnce, build a map from toolName to tool definition so handlers can detect subagent tools.",
        "In tool handlers (onStart/onUpdate/onEnd), when the tool is a subagent, emit corresponding subagent_* events alongside tool_execution_* events.",
        "Derive prompt from args.prompt (string) when possible; fallback to JSON-stringified args.",
        "For update/end events, extract output and ui from partial results when available; fallback to JSON-stringified value.",
        "Ensure subagent_* events are emitted in a stable order (start before update before end)."
      ],
      "acceptance": [
        "Types compile with new fields and events.",
        "Subagent tool definitions include metadata that can be consumed by UI.",
        "Subagent events fire without breaking existing tool_execution events.",
        "All emissions are null-safe and do not throw on unexpected shapes."
      ],
      "validation": [
        "Typecheck or build runtime package (if applicable).",
        "Manual inspection in TUI after later features: subagent events appear."
      ],
      "notes": "Avoid any breaking changes to existing AgentEvent consumers by keeping current event shapes intact."
    },
    {
      "id": "F02",
      "title": "CLI: subagent registry/config + tool registration",
      "status": "pending",
      "depends_on": ["F01"],
      "files": ["packages/coding-agent/src/cli.ts"],
      "steps": [
        "Introduce environment-based configuration for subagents: AGENTIK_SUBAGENTS (JSON array) and AGENTIK_SUBAGENTS_FILE (path to JSON).",
        "Define accepted JSON schema: [{ id: string, model?: string, instructions?: string }].",
        "Parse JSON safely with clear error messages if invalid or file is missing.",
        "Create a SubagentRegistry and register each spec with a config object that uses the subagent model (or main model fallback), instructions, and the base tool list (excluding subagent tools to avoid recursion).",
        "Create a subagent tool per spec via createSubagentTool and append to the main tool list.",
        "Log a short startup note in session.txt (later) indicating how many subagents were loaded (optional)."
      ],
      "acceptance": [
        "CLI accepts subagent configuration via env var or file.",
        "Subagent tools are registered and appear in tool list.",
        "Invalid configuration produces actionable error messages.",
        "No recursion: subagents do not see subagent tools by default."
      ],
      "validation": [
        "Manual run with AGENTIK_SUBAGENTS set to a small JSON array.",
        "If not run, note in session.txt."
      ],
      "notes": "Keep configuration optional; no change for users who do not set env vars."
    },
    {
      "id": "F03",
      "title": "TUI: theme tokens + markdown theme alignment",
      "status": "pending",
      "depends_on": ["F00"],
      "files": [
        "packages/coding-agent/src/tui/theme.ts",
        "packages/coding-agent/src/tui/markdown-theme.ts"
      ],
      "steps": [
        "Create theme.ts exporting minimal Codex-style color tokens (cyan/green/red/magenta + dim + default).",
        "Replace hard-coded hex colors in markdown-theme.ts with theme tokens and ANSI names where possible.",
        "Keep palette conservative: prefer default foreground plus dim; use cyan for links, red for errors, green for success, magenta for Codex/subagent accents.",
        "Ensure getDefaultMarkdownSyntaxStyle continues to return a cached SyntaxStyle.",
        "Update any references to old palette constants in TUI files later to use the new theme tokens."
      ],
      "acceptance": [
        "markdown-theme.ts no longer hardcodes large hex palette; uses minimal Codex-like colors.",
        "Theme tokens are reusable by other components.",
        "No runtime errors in SyntaxStyle creation."
      ],
      "validation": ["Manual TUI run after integration; confirm markdown still renders."],
      "notes": "Codex style guide prefers ANSI colors; avoid heavy custom colors in UI chrome."
    },
    {
      "id": "F04",
      "title": "TUI: layout refactor + chrome scaffolding",
      "status": "pending",
      "depends_on": ["F03"],
      "files": [
        "packages/coding-agent/src/tui/tui-app.ts",
        "packages/coding-agent/src/tui/components/box.ts",
        "packages/coding-agent/src/tui/components/text.ts",
        "packages/coding-agent/src/tui/components/spacer.ts"
      ],
      "steps": [
        "Refactor TuiApp layout to mirror Codex: scrollable transcript area, divider, bottom pane.",
        "Introduce a dim divider line below messages (use a TextRenderable or TextBlock). Update its width on resize.",
        "Add a left gutter or padding alignment consistent across transcript, status, and footer.",
        "Ensure scroll box remains sticky at bottom by default.",
        "Keep current message rendering functionality intact while reorganizing container structure."
      ],
      "acceptance": [
        "Layout uses consistent vertical stacking: transcript → divider → status/queued/input/footer.",
        "Divider appears and resizes with terminal width.",
        "Transcript remains scrollable and sticky.",
        "No regressions in basic message streaming."
      ],
      "validation": ["Manual TUI run; resize terminal and confirm layout stability."],
      "notes": "Prefer minimal chrome; avoid borders unless necessary."
    },
    {
      "id": "F05",
      "title": "TUI: multi-line textarea composer",
      "status": "pending",
      "depends_on": ["F04"],
      "files": [
        "packages/coding-agent/src/tui/components/textarea.ts",
        "packages/coding-agent/src/tui/tui-app.ts"
      ],
      "steps": [
        "Add a Textarea component wrapper around OpenTUI TextareaRenderable.",
        "Override keybindings so Enter submits and Shift+Enter inserts newline (also handle linefeed).",
        "Implement onSubmit callback to send prompt when not streaming; otherwise queue (follow-up or steering as per mode).",
        "Clamp composer height between 1 and 6 lines; recompute height on content change using virtualLineCount.",
        "Preserve Alt+Enter behavior for queueing follow-up messages (global key handler).",
        "Ensure placeholder text is shown when empty and focused."
      ],
      "acceptance": [
        "Enter submits; Shift+Enter inserts newline.",
        "Composer grows up to 6 lines and stops expanding thereafter.",
        "Queued message behavior still works while streaming.",
        "No crashes on rapid input or resize."
      ],
      "validation": ["Manual TUI run: type multi-line text, verify Enter/Shift+Enter."],
      "notes": "Keep input behavior consistent with Codex TUI."
    },
    {
      "id": "F06",
      "title": "TUI: status indicator + footer hints",
      "status": "pending",
      "depends_on": ["F04"],
      "files": [
        "packages/coding-agent/src/tui/components/status-line.ts",
        "packages/coding-agent/src/tui/components/footer-line.ts",
        "packages/coding-agent/src/tui/tui-app.ts"
      ],
      "steps": [
        "Create StatusLine component: spinner (when streaming), status text (Ready/Working/Tool: X), optional elapsed time.",
        "Use theme tokens for colors (dim + cyan/magenta).",
        "Create FooterLine component that shows key hints: `Enter send · Shift+Enter newline · Esc interrupt`.",
        "Append queue count and edit hint when queued messages exist.",
        "Truncate footer line when terminal width is small (basic width check).",
        "Wire into TuiApp render flow and update status text based on agent events."
      ],
      "acceptance": [
        "Status line updates on start/end/tool events.",
        "Footer hints are visible and readable.",
        "Queue hints update when messages are queued/dequeued."
      ],
      "validation": ["Manual TUI run with a streaming response and tool call."],
      "notes": "Keep footer unintrusive; prefer dim styling."
    },
    {
      "id": "F07",
      "title": "TUI: tool-call formatting + truncation",
      "status": "pending",
      "depends_on": ["F04"],
      "files": [
        "packages/coding-agent/src/tui/tool-call-formatter.ts",
        "packages/coding-agent/src/tui/tui-app.ts"
      ],
      "steps": [
        "Extract tool-call summary logic from TuiApp into tool-call-formatter.ts.",
        "Add max output line limit and ellipsis formatting (e.g., `… +N lines`).",
        "Render tool headers with spinner while running and green/red bullets when done.",
        "Summarize read/list/glob/bash/webfetch output counts similar to Codex.",
        "Dim details and indent with `  └ ` and `    ` prefixes.",
        "Update TuiApp to use formatter output and styled text consistently with theme tokens."
      ],
      "acceptance": [
        "Tool calls show compact header + summarized args/output.",
        "Large output is truncated with a clear indicator.",
        "Running vs success vs error states are visually distinct."
      ],
      "validation": ["Manual TUI run with read/list/glob/bash/webfetch tools."],
      "notes": "Avoid verbose dumping in the main transcript; keep detail terse."
    },
    {
      "id": "F08",
      "title": "TUI: subagent lanes and streaming",
      "status": "pending",
      "depends_on": ["F01", "F07"],
      "files": ["packages/coding-agent/src/tui/tui-app.ts"],
      "steps": [
        "Handle new subagent_* events in TuiApp.",
        "Create a message entry for subagent output labeled `[subagent:<id>]` and styled in magenta.",
        "Stream deltas into the subagent entry on subagent_update.",
        "Finalize on subagent_end and mark status as done/error accordingly.",
        "Suppress duplicate tool_execution_* rendering for subagent tool calls by tracking active subagent toolCallIds."
      ],
      "acceptance": [
        "Subagent output appears in the transcript with distinct labeling.",
        "Streaming updates are visible and incremental.",
        "Subagent tool calls do not create duplicate generic tool entries."
      ],
      "validation": ["Manual run with a configured subagent tool."],
      "notes": "Keep subagent entries aligned with the same gutter as main messages."
    },
    {
      "id": "F09",
      "title": "Docs/notes updates (optional)",
      "status": "pending",
      "depends_on": ["F05", "F06", "F07", "F08"],
      "files": ["README.md", "docs/*"],
      "steps": [
        "If behavior changes significantly, add a short note in README.md describing new keybindings and subagent config.",
        "Keep documentation minimal; do not over-specify internal implementation details."
      ],
      "acceptance": ["Docs reflect new input keybindings and subagent configuration if updated."],
      "validation": ["Manual doc review."],
      "notes": "Only do this if the user wants docs updated; otherwise leave pending."
    }
  ]
}
