[
  {
    "id": "SUG-001",
    "area": "runtime",
    "title": "Centralize agent prepare/headers logic",
    "files": ["packages/runtime/src/agent-runtime.ts:600", "packages/runtime/src/subagents.ts:96"],
    "summary": "prepareStep/prepareCall, header merging, and API key header resolution are duplicated in AgentRuntime and subagent helpers.",
    "suggested_change": "Extract the shared logic into a small utility module (for example, packages/runtime/src/agent-config-utils.ts) and reuse it in both files.",
    "rationale": "This reduces drift risk when provider handling changes and keeps behavior consistent between the main runtime and subagents.",
    "risk": "low",
    "effort": "medium",
    "status": "completed"
  },
  {
    "id": "SUG-002",
    "area": "runtime",
    "title": "Consolidate tool-result handling in stream loop",
    "files": ["packages/runtime/src/agent-runtime.ts:483"],
    "summary": "The tool-result, tool-error, and tool-output-denied cases repeat the same bookkeeping and event emission with only small differences.",
    "suggested_change": "Introduce a small helper (for example, handleToolFinalization) that accepts the toolCallId, toolName, output, and error flag, then reuse it in the three switch cases.",
    "rationale": "This removes duplication and makes any future changes to tool completion behavior safer and easier to implement.",
    "risk": "low",
    "effort": "small",
    "status": "completed"
  },
  {
    "id": "SUG-003",
    "area": "tui",
    "title": "Unify tool execution update/end rendering",
    "files": ["packages/coding-agent/src/tui/tui-app.ts:458"],
    "summary": "tool_execution_update and tool_execution_end build or update message entries using nearly identical logic.",
    "suggested_change": "Extract an upsert helper that resolves/creates the tool entry, applies formatted content, and updates toolCallEntries, then call it from both branches with the appropriate status/output.",
    "rationale": "Keeps tool UI handling consistent and reduces the chance of subtle divergence when the tool display format changes.",
    "risk": "low",
    "effort": "small"
  },
  {
    "id": "SUG-004",
    "area": "tui",
    "title": "Deduplicate padding resolution across TUI components",
    "files": [
      "packages/coding-agent/src/tui/components/box.ts:14",
      "packages/coding-agent/src/tui/components/text.ts:17",
      "packages/coding-agent/src/tui/components/markdown.ts:19",
      "packages/coding-agent/src/tui/components/truncated-text.ts:17"
    ],
    "summary": "resolvePadding is duplicated across multiple components with identical behavior.",
    "suggested_change": "Move resolvePadding to a shared helper (for example, components/padding.ts) and reuse it in each component.",
    "rationale": "Centralizing the logic avoids repeated code and ensures padding behavior stays consistent if the rules ever change.",
    "risk": "low",
    "effort": "small"
  },
  {
    "id": "SUG-005",
    "area": "tui",
    "title": "Centralize input clearing and submit paths",
    "files": [
      "packages/coding-agent/src/tui/tui-app.ts:161",
      "packages/coding-agent/src/tui/tui-app.ts:189"
    ],
    "summary": "The enter and alt-enter handlers repeat trimming, clearing the input, and dispatching to queue vs submit.",
    "suggested_change": "Add a small helper (for example, clearInput and submitFromInput) to unify the logic for both handlers.",
    "rationale": "Reduces duplication and makes future changes to input handling less error-prone.",
    "risk": "low",
    "effort": "small"
  },
  {
    "id": "SUG-006",
    "area": "tui",
    "title": "Break out tool arg/output summarizers",
    "files": [
      "packages/coding-agent/src/tui/tui-app.ts:702",
      "packages/coding-agent/src/tui/tui-app.ts:752"
    ],
    "summary": "summarizeToolArgs and summarizeToolOutput are long switch statements mixing formatting with routing logic.",
    "suggested_change": "Split each tool’s formatter into small per-tool helpers or a map of tool handlers, keeping the main methods as a simple dispatcher.",
    "rationale": "Shorter, focused helpers improve readability and make it easier to add new tools without growing the switch blocks.",
    "risk": "low",
    "effort": "medium"
  }
]
